
/

// 2: Переменная x хранит число. Написать код, который находит квадрат числа x.

// 3: Даны обрывки слов, требуется соединить их:
// Java
// ворд
// конкурентно
// способный
// оваться
// кросс
// Script
// поли
// морфизм
// ориентир

// 4: Дано число 7. Написать код, умножающий 7 на числа от 2-9.

// 5: Написать код, который проверяет, делится ли значение переменной на 5 без остатка или нет (вывести в консоль true или false)
// Комментарии
// Мои задания
// Сдано

// lesson2hp.js
// JavaScript
// Личные комментарии
// ДЗ 1.2. Типы данных 
// let num1 = 4
// let num2 = 12
// console.log(num1 + num2)

// // 2
// let x = "5"
// console.log(x * x)

// // 3
// let str_1 = 'Java'
// let str_2 = 'ворд'
// let str_3 = 'конкурентно' 
// let str_4 = 'способный'
// let str_5 = 'оваться'
// let str_6 = 'кросс'
// let str_7 = 'Script'
// let str_8 = 'поли'
// let str_9 = 'морфизм'
// let str_10 = 'ориентир'

// console.log('Java ' + 'ворд ' + 'конкурентно ' + 'способный ' + 'оваться ' + 'кросс ' + 'Script ' + 'поли ' + 'морфизм ' + 'ориентир ')

// //4
// let num = 7
// console.log(7*2, 7*3, 7*4, 7*5, 7*6, 7*7, 7*8, 7*9)

//5
let num = 23
console.log(num % 5 == 5) 
// console.log(num == 5)